In [38]:
import pandas
mySerie1 = pandas.Series([5, 6, 2, 9, 12])
print(mySerie1) 
myList=([5, 6, 2, 9, 12])
mySerie2 = pandas.Series(myList) 
print(mySerie2)

0     5
1     6
2     2
3     9
4    12
dtype: int64
0     5
1     6
2     2
3     9
4    12
dtype: int64

In [5]:
myDico = {'Cochise County': 12, 'Pima County': 342, 'Santa Cruz County': 13, 'Maricopa County': 42, 'Yuma County' : 52}
#On peut définir une série à partir de ce dictionnaire comme suit:
mySerie = pandas.Series(myDico)
print(mySerie)

Cochise County        12
Pima County          342
Santa Cruz County     13
Maricopa County       42
Yuma County           52
dtype: int64

In [6]:
mySerie = pandas.Series([5, 6, 2, 9, 12],index=['Cochise County', 
'Pima County', 'Santa Cruz County', 'Maricopa County', 'Yuma County'])
print(mySerie)

Cochise County        5
Pima County           6
Santa Cruz County     2
Maricopa County       9
Yuma County          12
dtype: int64

In [7]:
myList=[5, 6, 2, 9, 12] # définition de la liste des valeurs
myIndices=['Cochise County', 'Pima County', 'Santa Cruz County', 
'Maricopa County', 'Yuma County'] # définition de la liste des indices
mySerie = pandas.Series(myList, myIndices) # définition de la série
print(mySerie)

Cochise County        5
Pima County           6
Santa Cruz County     2
Maricopa County       9
Yuma County          12
dtype: int64

In [9]:
print(mySerie[0]) # Selection du premier élément (méthode classique)
print(mySerie["Cochise County"]) # Selection du premier élément 
#(sélection par l'index)

5
5

In [13]:
dico ={'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
 'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
 'age': [42, 52, 36, 24, 73],
 'preTestScore': [4, 24, 31, 2, 3],
 'postTestScore': [25, 94, 57, 62, 70]}
#On crée le dataframe comme suit: 
mydata = pandas.DataFrame(dico, columns = ['first_name', 'last_name', 
'age', 'preTestScore', 'postTestScore'])#création de dataFrame à partir du dictionnaire avec commme colonne les clEs du dictionnaire(ici dico)
print(mydata)

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Molly  Jacobson   52            24             94
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70

In [14]:
mydata = pandas.DataFrame(index=range(0), columns = ['id_var', 'myvar1', ' myvar2']) 
mydata

Empty DataFrame
Columns: [id_var, myvar1,  myvar2]
Index: []

In [19]:
#data1
raw_data = {
 'subject_id': ['1', '2', '3', '4', '5'],
 'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
 'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 
'Atiches']}
df_a = pandas.DataFrame(raw_data, columns = ['subject_id', 
'first_name', 'last_name'])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [20]:
#Data2
raw_data = {
 'subject_id': ['4', '5', '6', '7', '8'],
 'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
 'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 
'Btisan']}
df_b = pandas.DataFrame(raw_data, columns = ['subject_id', 
'first_name', 'last_name'])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [18]:


# Data3
raw_data = {
 'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', 
'11'],
 'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pandas.DataFrame(raw_data, columns = ['subject_id','test_id'])

In [21]:
df_new = pandas.concat([df_a, df_b])
print(df_new)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [42]:
# si on voudrai travaller en regroupant tous les dataFrames,puisque subject_ide est unique pour chaque observation,
#on peut simplement suprimer les index en le remplaçant par subject_id
#new_df=df_new.set_index("subject_id")
#new_df

           first_name last_name first_name last_name
subject_id
(1, 4)           Alex  Anderson      Billy    Bonder
(2, 5)            Amy  Ackerman      Brian     Black
(3, 6)          Allen       Ali       Bran   Balwner
(4, 7)          Alice      Aoni      Bryce     Brice
(5, 8)         Ayoung   Atiches      Betty    Btisan

In [44]:
df_new=pandas.concat([df_a, df_b], axis=1) # axis=1 signifie qu'on s'interesse aux colonnes plutôt qu'aux lignes
df_new

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [49]:
raw_data = {'patient': [1, 1, 1, 2, 2],
 'obs': [1, 2, 3, 1, 2],
 'treatment': [0, 1, 0, 1, 0],
 'score': [6252, 24243, 2345, 2342, 23525]}
#df_long = pandas.DataFrame(raw_data, columns = ['patient', 'obs', 'treatment', 'score']) methode 1
df_long = pandas.DataFrame(raw_data, columns =raw_data.keys())#methode2
print(df_long)
#conversion en format wide
df_wide=df_long.pivot(index='patient', columns='obs', values='score')
#print(df_wide)

   patient  obs  treatment  score
0        1    1          0   6252
1        1    2          1  24243
2        1    3          0   2345
3        2    1          1   2342
4        2    2          0  23525

In [29]:
dico={'region': ['North', 'Yorkshire', 'Northeast', 'East Midlands', 
'West Midlands','East Anglia','Southeast','Southwest','Wales','Scotland','Northern Ireland'],
 'alcohol': [6.47, 6.13, 6.19, 4.89, 
5.63,4.52,5.89,4.79,5.27,6.08,4.02],
 'tobacco': [4.03, 3.76, 3.77, 3.34, 
3.47,2.92,3.20,2.71,3.53,4.51, 4.56]
 } 
df=pandas.DataFrame(dico, columns = ['region', 'alcohol', 'tobacco'])
print(df)

              region  alcohol  tobacco
0              North     6.47     4.03
1          Yorkshire     6.13     3.76
2          Northeast     6.19     3.77
3      East Midlands     4.89     3.34
4      West Midlands     5.63     3.47
5        East Anglia     4.52     2.92
6          Southeast     5.89     3.20
7          Southwest     4.79     2.71
8              Wales     5.27     3.53
9           Scotland     6.08     4.51
10  Northern Ireland     4.02     4.56

In [31]:
import numpy
vdata1 = numpy.matrix(df)
print(vdata1)

[['North' 6.47 4.03]
 ['Yorkshire' 6.13 3.76]
 ['Northeast' 6.19 3.77]
 ['East Midlands' 4.89 3.34]
 ['West Midlands' 5.63 3.47]
 ['East Anglia' 4.52 2.92]
 ['Southeast' 5.89 3.2]
 ['Southwest' 4.79 2.71]
 ['Wales' 5.27 3.53]
 ['Scotland' 6.08 4.51]
 ['Northern Ireland' 4.02 4.56]]

In [56]:
 vdata1.ndim

2

In [67]:
sama_numpy=numpy.array([[[1,2,3,4],[4,5,6,7],['a','b','c','o']],[['x','y','z','w'],['t','r','s','m'],['d','e','f','i']]]
                   )
sama_numpy.shape

(2, 3, 4)

In [70]:
len(sama_numpy.shape)

3

In [71]:
sama_numpy.ndim

3